Обработки/Reports/_ОтчетОПервичныхДокументах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОПервичныхДокументах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОПервичныхДокументах/Ext/ObjectModule.bsl
Перем ТаблицаРабочихДат;
Перем ОтчетФормируетсяИнтерактивно;
Перем МассивСпецДеповДляАвтоформирования;

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о первичных документах",
		"0.44",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОтчетОПервичныхДокументахЗаПредыдущийРабочийДеньРЭМ", "Отчет о первичных документах за предыдущий рабочий день",,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОтчетОПервичныхДокументахЗаПредыдущийРабочийДеньТраст", "Отчет о первичных документах за предыдущий рабочий день",,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если Найти(ИдентификаторКоманды, "ОтчетОПервичныхДокументахЗаПредыдущийРабочийДень") = 1  Тогда
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата())) Тогда
			ЭтотОбъект.Период		= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ТекущаяДата() - 60 * 60 * 24); 
			ЭтотОбъект.Организация	= ПараметрыКоманды.Организация;
			ПолучателиОповещения	= ПараметрыКоманды.ПолучателиОповещения;
			
			ОтправитьОтчет(ПолучателиОповещения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ОтправитьОтчет(ПолучателиОповещения) Экспорт
	
	ОтчетФормируетсяИнтерактивно = Ложь;
	
	МассивСпецДеповДляАвтоформирования.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СпецДепозитарий_ВТБ"));
	МассивСпецДеповДляАвтоформирования.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_ЦСД"));
	
	Результат = Новый ТабличныйДокумент;
	ЗаполнитьОтчетОПервичныхДокументах(Результат);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
	Результат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
	
	ТемаПисьма = Строка(ЭтотОбъект.Организация.Наименование) + ". Отчет о первичных документах за " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yy");
	
	ТелоПисьма = Новый ТекстовыйДокумент;
	ТелоПисьма.Прочитать(ИмяВременногоФайла);
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОповещения, ТемаПисьма, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
	
	РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетФормируетсяИнтерактивно = Истина;
	
	ЗаполнитьОтчетОПервичныхДокументах(ДокументРезультат);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗаполнитьОтчетОПервичныхДокументах(ДокументРезультат)
		
	ДокументРезультат.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаЛишние	= Макет.ПолучитьОбласть("ШапкаЛишние");
	ОбластьСтрокаЛишние = Макет.ПолучитьОбласть("СтрокаЛишние");
	
	ДанныеДляПроверки = ПолучитьДанныеДляПроверки();
	
	ДокументыЭДО = ПолучитьДокументыЭДО();	
	
	Если ДокументыЭДО = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлено соединение с ЭДО ВТБ!");
		Возврат;
	КонецЕсли;
	
	//Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,ВидыДоговоровДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ЗаполнитьОтчетОПервичныхДокументах()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Для Каждого СтрокаСчетаДоверительногоУправления Из ДанныеДляПроверки.СчетаДоверительногоУправления Цикл
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СтрокаСчетаДоверительногоУправления);
		ДокументРезультат.Вывести(ОбластьШапка);
		
		Если ЗначениеЗаполнено(СтрокаСчетаДоверительногоУправления.КодДепозитария) Тогда
			ПроверкаИнвестСчета(СтрокаСчетаДоверительногоУправления, ДокументРезультат);
		КонецЕсли;
	
		СверкаДвиженияПоРасчетнымСчетам(СтрокаСчетаДоверительногоУправления	, ДанныеДляПроверки.ДвиженияПоРасчетнымСчетам, ДокументыЭДО, ДокументРезультат);
		СверкаОтчетаБрокера(СтрокаСчетаДоверительногоУправления, ДанныеДляПроверки.ОтчетыБрокера, ДокументыЭДО, ДокументРезультат);
		СверкаСЧА_РСА(СтрокаСчетаДоверительногоУправления, ДанныеДляПроверки.СЧА_РСА, ДокументыЭДО, ДокументРезультат);
		
		ПроверкаМНО(СтрокаСчетаДоверительногоУправления, ДанныеДляПроверки.МНО, ДокументыЭДО, ДокументРезультат);
		
		ПроверкаМНОЗаСледующийДень(СтрокаСчетаДоверительногоУправления, ДанныеДляПроверки.МНОЗаСледующийДень, ДокументыЭДО, ДокументРезультат)
	
	КонецЦикла;
	
	Если ДокументыЭДО.Количество() > 0 Тогда
		
		ДокументРезультат.Вывести(ОбластьШапкаЛишние);
		
		ДокументыЭДО.Сортировать("ИнвестСчет");
		Для Каждого СтрокаЭДО Из ДокументыЭДО Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаЛишние.Параметры, СтрокаЭДО);
			ДокументРезультат.Вывести(ОбластьСтрокаЛишние);
		КонецЦикла;
		
	КонецЕсли;
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьСписокИнвестСчетов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",							Организация);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления",			СчетаДоверительногоУправления.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ВидыДоговоровДоверительногоУправления",	ВидыДоговоровДоверительногоУправления.ВыгрузитьЗначения());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыИнветСчетов.Значение КАК ИнвестСчет
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК КодыИнветСчетов
		|		ПО СчетаДоверительногоУправления.Ссылка = КодыИнветСчетов.Объект
		|			И (КодыИнветСчетов.Свойство.Ключ = ""ВнешняяОбработка._ЭкспортДанныхВСЭДВТБ.ИнвестСчет"")
		|ГДЕ
		|	(СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний))
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.Ссылка В (&СчетаДоверительногоУправления)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровДоверительногоУправления))";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИнвестСчет");
	
КонецФункции

Функция ПолучитьДокументыЭДО()
	
	СписокИнвестСчетов = ПолучитьСписокИнвестСчетов();
	
	ИнвестСчета = "";
	
	Для Каждого ТекИнвестСчет Из СписокИнвестСчетов Цикл
		
		Если ИнвестСчета <> "" Тогда
			ИнвестСчета = ИнвестСчета + ", ";
		КонецЕсли;
		
		ИнвестСчета = ИнвестСчета + "'" + ТекИнвестСчет + "'";
		
	КонецЦикла;
	
	Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда 
		полеСервер	= "AP4";	
		полеЛогин	= "EDOODK_RAM_reader"; 
		полеПароль	= "ERR678ik";
		полеБД		= "ODK_RAM";
		
	ИначеЕсли ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		полеСервер	= "AP3";
		полеЛогин	= "EDOODK_PI_reader"; 
		полеПароль	= "EPR456yh";
		полеБД		= "EDOODK_PI";
		
	ИначеЕсли ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		полеСервер	= "AP3";	
		полеЛогин	= "EDOODK_RT_reader"; 
		полеПароль	= "ERR567uj";
		полеБД		= "EDOODK_RT";
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаСоединенияССерверомSQL = "Driver={SQL Server};Server=" + полеСервер + ";UID=" + полеЛогин + ";PWD=" + полеПароль + ";Database=" + полеБД;
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("КодДокумента"		, Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("КодДепозитария"	, Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("ИнвестСчет"		, Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("Номер"			, Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("Дата"				, Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипыКолонок.Вставить("Сумма"			, Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("Инфо"				, Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("Валюта"			, Новый ОписаниеТипов("Строка"));
	
	ТекстЗапросаSQL = 
		"SET ARITHABORT ON
		|
		|Select
		|	Tab.DocCode	as КодДокумента,
		|	Tab.DepCode as КодДепозитария,
		|	Tab.IDInvestcase as ИнвестСчет,
		|	Tab.DataDoc as Дата,
		|	Tab.PayAmount as Сумма,
		|	Tab.DocNumber as Номер,
		|	Tab.ReportKeyInfo as Инфо,
		|	Tab.IDCurrency as Валюта
		|From
		|	(SELECT 
		|		RIGHT([t_EDOTaskAttachment].[DocNumber], 3) as DocCode,
		|		LEFT([t_EDOTaskAttachment].[DocNumber], 3) as DepCode,
		|		[t_EDOTaskAttachment].[DocNumber] as DocNumber,
		|		Case Right([t_EDOTaskAttachment].[DocNumber], 3)
		|			When '522'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/cdsXMLHeader/ROW/@IDSourceInvestCase)[1]', 'nvarchar(10)') 
		|			When '555'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/cdsXMLHeader/ROW/@IDSourceInvestCase)[1]', 'nvarchar(10)') 
		|			When '527'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@IDInvestcase)[1]', 'nvarchar(10)') 
		|			When '520'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/cdsXMLHeader/ROW/@IDSourceInvestCase)[1]', 'nvarchar(10)') 
		|			When 'NTD'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/cdsXMLHeader/ROW/@IDSourceInvestCase)[1]', 'nvarchar(10)') 
		|			Else
		|				Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@IDInvestcase)[1]', 'nvarchar(10)')
		|			End as IDInvestcase,
		|		Case Right([t_EDOTaskAttachment].[DocNumber], 3)
		|			When '522'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@DocDate)[1]', 'datetime') 
		|			When '527' Then
		|				IsNull(Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@WriteOffDate)[1]', 'datetime'),
		|						Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@PayDate)[1]', 'datetime'))
		|			When '520'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@TheDate)[1]', 'datetime') 
		|			When '530'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@RequestDate)[1]', 'datetime') 
		|			When 'NTD'
		|				Then [DateOfCreate]
		|			Else
		|				Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@ReportOnDate)[1]', 'datetime')
		|			End as DataDoc,
		|		Case Right([t_EDOTaskAttachment].[DocNumber], 4)
		|			When 'F527'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@PayAmount)[1]', 'nvarchar(20)') 
		|			When 'F530'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@DopDogSumm1)[1]', 'nvarchar(20)') 
		|			Else
		|				'0'
		|			End as PayAmount,
		|			Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/cdsXMLHeader/ROW/@ReportKeyInfo)[1]', 'nvarchar(256)') as ReportKeyInfo,
		|			Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@IDCurrency)[1]', 'nvarchar(3)') as IDCurrency
		|	FROM 
		|		[" + полеБД +"].[dbo].[t_EDOTaskAttachment] as [t_EDOTaskAttachment]
		|	INNER JOIN
		|		[" + полеБД + "].[dbo].[t_EDOTask] as [t_EDOTask] ON [t_EDOTask].[DocNumber] = [t_EDOTaskAttachment].[DocNumber] and 
		|														--([ToEMail] like '%operedo@odk.ru%' or [ToEMail] like '%operedo@vtbsd.ru%') and
		|														(([IDFromPerson] <> '1' and [IDFromPerson] <> '2') or (Right([t_EDOTaskAttachment].[DocNumber], 4) = 'F527' and LEFT([t_EDOTaskAttachment].[DocNumber], 3) = 'VTB')) and 
		|														[DateEMail] is not Null and
		|														[DateOfCreate] between CONVERT(datetime, '&Период&', 104) and CONVERT(datetime, '&ПериодПлюс10&', 104)
		|	Where
		|		Right([t_EDOTaskAttachment].[DocNumber], 3) IN ('527', '522','015','025', '029','530','520','NTD') and
		|		(Case Right([t_EDOTaskAttachment].[DocNumber], 3)
		|			When '522'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@DocDate)[1]', 'nvarchar(10)') 
		|			When '527' Then
		|				IsNull(Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@WriteOffDate)[1]', 'nvarchar(10)'),
		|						Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@PayDate)[1]', 'nvarchar(10)'))
		|			When '520'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@TheDate)[1]', 'nvarchar(10)') 
		|			When '530'
		|				Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@RequestDate)[1]', 'nvarchar(10)') 
		|			Else
		|				Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@ReportOnDate)[1]', 'nvarchar(10)')
		|			End Between '&Период&'  and '&Период&'
		|			OR
		|			Case Right([t_EDOTaskAttachment].[DocNumber], 3)
		|				When '530'
		|					Then Convert(XML, [XMLBody]).value('(Spec_Dep_EDODocument/ClientCashData/ROW/@RequestDate)[1]', 'nvarchar(10)') 
		|				When 'NTD'
		|					Then CONVERT(nvarchar(30), [DateOfCreate], 104)
		|				End	Between '&ПериодПлюсОдин&'  and '&ПериодПлюсОдин&')
		|			and [t_EDOTaskAttachment].[DocNumber] IN (Select ParentDocNumber From [" + полеБД + "].[dbo].[t_EDOTaskAttachment])
		|) as Tab
		|Where
		|	IsNull(Tab.IDInvestcase,0) <> 0
		|" + ?(ИнвестСчета <> "", "	AND Tab.IDInvestcase IN(" + ИнвестСчета + ")", "") + "
		|Group by
		|	Tab.DocCode,
		|	Tab.DepCode,
		|	Tab.IDInvestcase,
		|	Tab.DataDoc,
		|	Tab.PayAmount,
		|	Tab.DocNumber,
		|	Tab.ReportKeyInfo,
		|	Tab.IDCurrency
		|";
		
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Период&"			, Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"));	
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&ПериодПлюсОдин&"	, Формат(ДобавитьКДатеРабочиеДниКеш(ЭтотОбъект.Период, 1), "ДФ=dd.MM.yyyy"));	
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&ПериодПлюс10&"		, Формат(ЭтотОбъект.Период + 60 * 60 * 24 * 11, "ДФ=dd.MM.yyyy"));
	
	СдвигДаты = 2;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(РАЗНОСТЬДАТ(ДанныеКалендаря.Дата, &Дата, ДЕНЬ)) КАК СдвигДаты
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И РАЗНОСТЬДАТ(ДанныеКалендаря.Дата, &Дата, ДЕНЬ) >= &СдвигДаты
		|	И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
		|			ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))";

	Запрос.УстановитьПараметр("Дата"		, ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("СдвигДаты"	, СдвигДаты);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СдвигДаты = Выборка.СдвигДаты;
	КонецЕсли;
	
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&СдвигДаты&", СдвигДаты);
	
	СледующийДень = ДобавитьКДатеРабочиеДниКеш(ЭтотОбъект.Период, 1);
	
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&СледующийДень&", Формат(СледующийДень, "ДФ=dd.MM.yyyy"));
	
	ПараметрыСоединения = Новый Структура;
	ПараметрыСоединения.Вставить("CommandTimeOut", 0);
	
	Если ОтчетФормируетсяИнтерактивно Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("РежимБезУведомлений"	, Истина);
		ДополнительныеПараметры.Вставить("Ошибки"				, Новый Массив);
		
		ДокументыЭДО = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединенияССерверомSQL, ТекстЗапросаSQL, ТипыКолонок, ПараметрыСоединения, ДополнительныеПараметры);
		
		Если ДополнительныеПараметры.Ошибки.Количество() = 1 И СтрЧислоВхождений(ДополнительныеПараметры.Ошибки[0], "Запустите транзакцию повторно") > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("СЭД заблокирован. Запустите формирование отчёта снова.");
			Возврат Неопределено;
		ИначеЕсли ДополнительныеПараметры.Ошибки.Количество() <> 0 Тогда
			ИсточникОшибки = "Дополнительные отчеты и обработки.Отчет о первичных документах";
			
			Для Каждого ТекстОшибки Из ДополнительныеПараметры.Ошибки Цикл
				ЗаписьЖурналаРегистрации(ИсточникОшибки, УровеньЖурналаРегистрации.Ошибка, , ИсточникОшибки, ТекстОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЦикла;
			
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		ДокументыЭДО = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединенияССерверомSQL, ТекстЗапросаSQL, ТипыКолонок, ПараметрыСоединения);
	КонецЕсли;
	
	Если ДокументыЭДО = Неопределено Тогда
		ДокументыЭДО = Новый ТаблицаЗначений;
		ДокументыЭДО.Колонки.Добавить("КодДокумента"		, Новый ОписаниеТипов("Строка"));
		ДокументыЭДО.Колонки.Добавить("КодДепозитария"		, Новый ОписаниеТипов("Строка"));
		ДокументыЭДО.Колонки.Добавить("ИнвестСчет"			, Новый ОписаниеТипов("Строка"));
		ДокументыЭДО.Колонки.Добавить("Номер"				, Новый ОписаниеТипов("Строка"));
		ДокументыЭДО.Колонки.Добавить("Дата"				, Новый ОписаниеТипов("Дата"));
		ДокументыЭДО.Колонки.Добавить("Сумма"				, Новый ОписаниеТипов("Число"));
		ДокументыЭДО.Колонки.Добавить("Инфо"				, Новый ОписаниеТипов("Строка"));
		ДокументыЭДО.Колонки.Добавить("Валюта"				, Новый ОписаниеТипов("Строка"));
		
	КонецЕсли;	
	
	Возврат ДокументыЭДО;
	
КонецФункции

Функция ПолучитьДанныеДляПроверки()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	
#Область ТекстЗапроса	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	ЕСТЬNULL(КодыИнветСчетов.Значение, """") КАК ИнвестСчет,
		|	СчетаДоверительногоУправления.СпециализированныйДепозитарий = ЗНАЧЕНИЕ(Справочник.ДепозитарныеКомпании.ПустаяСсылка) КАК НеВыбранСпецДепозитарий,
		|	ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, """") КАК КодДепозитария,
		|	СчетаДоверительногоУправления.Наименование + ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА "" (ПР)""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА "" (ПН)""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	ЕСТЬNULL(КонтрольСЧАРСА.Значение, ЛОЖЬ) КАК КонтрольСЧАРСА,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(КонтрольМНО.Значение КАК БУЛЕВО), ЛОЖЬ) КАК КонтрольМНО
		|ПОМЕСТИТЬ ВТ_СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК КодыИнветСчетов
		|		ПО СчетаДоверительногоУправления.Ссылка = КодыИнветСчетов.Объект
		|			И (КодыИнветСчетов.Свойство.Ключ = ""ВнешняяОбработка._ЭкспортДанныхВСЭДВТБ.ИнвестСчет"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО СчетаДоверительногоУправления.СпециализированныйДепозитарий = ЗначенияДополнительныхСведений.Объект
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ВнешняяОбработка._ОтчетОПервичныхДокументах.КодСпецДепозитария"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК КонтрольСЧАРСА
		|		ПО СчетаДоверительногоУправления.Ссылка = КонтрольСЧАРСА.Объект
		|			И (КонтрольСЧАРСА.Свойство.Ключ = ""ВнешняяОбработка._ОтчетОПервичныхДокументах.КонтрольСЧАРСА"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК КонтрольМНО
		|		ПО СчетаДоверительногоУправления.Ссылка = КонтрольМНО.Объект
		|			И (КонтрольМНО.Свойство.Ключ = ""ВнешняяОбработка._ОтчетОПервичныхДокументах.КонтрольМНО"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|ГДЕ
		|	(СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний))
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|	И (СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаОкончания
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|	И (СчетаДоверительногоУправления.Ссылка В (&СчетаДоверительногоУправления)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровДоверительногоУправления)
		|			ИЛИ СчетаДоверительногоУправления.СпециализированныйДепозитарий В (&МассивСпецДеповДляАвтоформирования))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВТ_СчетаДоверительногоУправления.ИнвестСчет КАК ИнвестСчет,
		|	ВТ_СчетаДоверительногоУправления.НеВыбранСпецДепозитарий КАК НеВыбранСпецДепозитарий,
		|	ВТ_СчетаДоверительногоУправления.КодДепозитария КАК КодДепозитария,
		|	ВТ_СчетаДоверительногоУправления.Наименование КАК Наименование,
		|	ВТ_СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	&ДатаНачала КАК ДатаОтчета,
		|	ЕСТЬNULL(ВТ_СчетаДоверительногоУправления.КодДепозитария, """") = """" КАК ПолеСортировки
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	ВТ_СчетаДоверительногоУправления КАК ВТ_СчетаДоверительногоУправления
		|ГДЕ
		|	ВТ_СчетаДоверительногоУправления.НеВыбранСпецДепозитарий = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_СчетаДоверительногоУправления.КодДепозитария КАК КодДепозитария,
		|	ВТ_СчетаДоверительногоУправления.ИнвестСчет КАК ИнвестСчет,
		|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредствОбороты.Период, ДЕНЬ), ДанныеКалендаря.Дата) КАК Дата,
		|	ВЫБОР
		|		КОГДА ВТ_СчетаДоверительногоУправления.КодДепозитария = ""MSD""
		|				ИЛИ ОстаткиДенежныхСредствОбороты.Период ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ОстаткиДенежныхСредствОбороты.СуммаОборот
		|	КОНЕЦ КАК Сумма,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.Наименование КАК Банк,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.НомерСчета КАК НомерСчета,
		|	ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ДвиженияПоРасчетнымСчетам
		|ИЗ
		|	ВТ_СчетаДоверительногоУправления КАК ВТ_СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|		ПО ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления = ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления
		|			И (ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация)
		|			И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|				ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|			И (ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				Запись,
		|				Организация = &Организация
		|					И Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|					И РасчетныйСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути)) КАК ОстаткиДенежныхСредствОбороты
		|		ПО (ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления)
		|			И (ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = ОстаткиДенежныхСредствОбороты.РасчетныйСчет)
		|			И (НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредствОбороты.Период, ДЕНЬ) = ДанныеКалендаря.Дата)
		|ГДЕ
		|	ВТ_СчетаДоверительногоУправления.НеВыбранСпецДепозитарий = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СчетаДоверительногоУправления.КодДепозитария,
		|	ВТ_СчетаДоверительногоУправления.ИнвестСчет,
		|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредствОбороты.Период, ДЕНЬ), ДанныеКалендаря.Дата),
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.Наименование,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.НомерСчета,
		|	ВЫБОР
		|		КОГДА ВТ_СчетаДоверительногоУправления.КодДепозитария = ""MSD""
		|				ИЛИ ОстаткиДенежныхСредствОбороты.Период ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ОстаткиДенежныхСредствОбороты.СуммаОборот
		|	КОНЕЦ,
		|	ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СчетаДоверительногоУправления.КодДепозитария,
		|	ВТ_СчетаДоверительногоУправления.ИнвестСчет,
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваВКредитныхИнструментахОбороты.Период, ДЕНЬ),
		|	0,
		|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.Наименование,
		|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.НомерСчета,
		|	ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Запись,
		|			Организация = &Организация
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СчетаДоверительногоУправления КАК ВТ_СчетаДоверительногоУправления
		|		ПО ДенежныеСредстваВКредитныхИнструментахОбороты.СчетДоверительногоУправления = ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			И (ВТ_СчетаДоверительногоУправления.НеВыбранСпецДепозитарий = ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СчетаДоверительногоУправления.КодДепозитария КАК КодДепозитария,
		|	ВТ_СчетаДоверительногоУправления.ИнвестСчет КАК ИнвестСчет,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК КодСчетаУБрокера,
		|	ВТ_СчетаДоверительногоУправления.Организация.ВалютаУчета КАК Валюта,
		|	""810"" КАК КодВалюты,
		|	ДанныеКалендаря.Дата КАК Дата,
		|	ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ОтчетыБрокера
		|ИЗ
		|	ВТ_СчетаДоверительногоУправления КАК ВТ_СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаОкончания, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|			ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ПО (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления)
		|			И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|				ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|				ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|			И (ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|ГДЕ
		|	ВТ_СчетаДоверительногоУправления.НеВыбранСпецДепозитарий = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СчетаДоверительногоУправления.КодДепозитария,
		|	ВТ_СчетаДоверительногоУправления.ИнвестСчет,
		|	СделкаСВалютой.Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код,
		|	ВалютаСделки.Ссылка,
		|	ВЫБОР
		|		КОГДА ВалютаСделки.Код = ""643""
		|			ТОГДА ""810""
		|		ИНАЧЕ ВалютаСделки.Код
		|	КОНЕЦ,
		|	НАЧАЛОПЕРИОДА(СделкаСВалютой.Дата, ДЕНЬ),
		|	ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|ИЗ
		|	ВТ_СчетаДоверительногоУправления КАК ВТ_СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаОкончания, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|			ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ПО (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления)
		|			И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|				ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|				ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ПО ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления = СделкаСВалютой.СчетДоверительногоУправления
		|			И (СделкаСВалютой.Проведен)
		|			И (СделкаСВалютой.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютаСделки
		|		ПО (ВЫБОР
		|				КОГДА СделкаСВалютой.Валюта = ВТ_СчетаДоверительногоУправления.Организация.ВалютаУчета
		|					ТОГДА СделкаСВалютой.Контрвалюта
		|				ИНАЧЕ СделкаСВалютой.Валюта
		|			КОНЕЦ = ВалютаСделки.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СчетаДоверительногоУправления.КодДепозитария КАК КодДепозитария,
		|	ВТ_СчетаДоверительногоУправления.ИнвестСчет КАК ИнвестСчет,
		|	&ДатаНачала КАК Дата,
		|	ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СЧА_РСА
		|ИЗ
		|	ВТ_СчетаДоверительногоУправления КАК ВТ_СчетаДоверительногоУправления
		|ГДЕ
		|	ВТ_СчетаДоверительногоУправления.КонтрольСЧАРСА = ИСТИНА
		|	И ВТ_СчетаДоверительногоУправления.НеВыбранСпецДепозитарий = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_СчетаДоверительногоУправления.КодДепозитария КАК КодДепозитария,
		|	ВТ_СчетаДоверительногоУправления.ИнвестСчет КАК ИнвестСчет,
		|	НАЧАЛОПЕРИОДА(МНО.Дата, ДЕНЬ) КАК Дата,
		|	ВЫБОР
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000001"" И ""000009""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 6, 1)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000010"" И ""000099""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 5, 2)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000100"" И ""000999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 4, 3)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""001000"" И ""009999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 3, 4)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""010000"" И ""099999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 2, 5)
		|		ИНАЧЕ НомераОбъектов.Номер
		|	КОНЕЦ КАК НомерПодтверждения,
		|	МНО.Номер КАК Номер,
		|	МНО.Сумма КАК Сумма,
		|	ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВТ_СчетаДоверительногоУправления.КонтрольМНО КАК КонтрольМНО,
		|	ВЫБОР
		|		КОГДА МНО.РасчетныйСчет.Банк = &Банк_ГПБ
		|			ТОГДА ""подтверждение""
		|		ИНАЧЕ ""мно""
		|	КОНЕЦ КАК СтрокаПоиска1
		|ПОМЕСТИТЬ _ДанныеМНО
		|ИЗ
		|	Документ.МНО КАК МНО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СчетаДоверительногоУправления КАК ВТ_СчетаДоверительногоУправления
		|		ПО (МНО.Организация = &Организация)
		|			И МНО.СчетДоверительногоУправления = ВТ_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			И (МНО.Дата МЕЖДУ &ДатаНачала И &ДатаОкончанияПлюсОдин)
		|			И (МНО.Проведен)
		|			И (НЕ ВТ_СчетаДоверительногоУправления.НеВыбранСпецДепозитарий)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|		ПО МНО.Организация = НомераОбъектов.Организация
		|			И МНО.СчетДоверительногоУправления = НомераОбъектов.СчетДоверительногоУправления
		|			И МНО.Основание = НомераОбъектов.Объект
		|			И (ГОД(МНО.Дата) = НомераОбъектов.Год)
		|			И (НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеМНО.КодДепозитария КАК КодДепозитария,
		|	_ДанныеМНО.ИнвестСчет КАК ИнвестСчет,
		|	_ДанныеМНО.Дата КАК Дата,
		|	_ДанныеМНО.НомерПодтверждения КАК НомерПодтверждения,
		|	_ДанныеМНО.Номер КАК Номер,
		|	_ДанныеМНО.Сумма КАК Сумма,
		|	_ДанныеМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДанныеМНО.КонтрольМНО КАК КонтрольМНО,
		|	_ДанныеМНО.СтрокаПоиска1 КАК СтрокаПоиска1
		|ПОМЕСТИТЬ _МНО
		|ИЗ
		|	_ДанныеМНО КАК _ДанныеМНО
		|ГДЕ
		|	_ДанныеМНО.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеМНО.КодДепозитария КАК КодДепозитария,
		|	_ДанныеМНО.ИнвестСчет КАК ИнвестСчет,
		|	_ДанныеМНО.Дата КАК Дата,
		|	_ДанныеМНО.НомерПодтверждения КАК НомерПодтверждения,
		|	_ДанныеМНО.Номер КАК Номер,
		|	_ДанныеМНО.Сумма КАК Сумма,
		|	_ДанныеМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДанныеМНО.СтрокаПоиска1 КАК СтрокаПоиска1
		|ПОМЕСТИТЬ _МНОЗаСледующийДень
		|ИЗ
		|	_ДанныеМНО КАК _ДанныеМНО
		|ГДЕ
		|	_ДанныеМНО.Дата МЕЖДУ &ДатаНачалаПлюсОдин И &ДатаОкончанияПлюсОдин
		|	И _ДанныеМНО.КонтрольМНО";
#КонецОбласти		

	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("ДатаНачалаПлюсОдин", ДобавитьКДатеРабочиеДниКеш(ЭтотОбъект.Период, 1));
	Запрос.УстановитьПараметр("ДатаОкончанияПлюсОдин", КонецДня(ДобавитьКДатеРабочиеДниКеш(ЭтотОбъект.Период, 1)));
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДоверительногоУправления.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ВидыДоговоровДоверительногоУправления", ВидыДоговоровДоверительногоУправления.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("МассивСпецДеповДляАвтоформирования",	МассивСпецДеповДляАвтоформирования);
	Запрос.УстановитьПараметр("Банк_ГПБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ГПБ"));
	
	Запрос.Выполнить();
	
	ДанныеДляСверки = Новый Структура;
	ДанныеДляСверки.Вставить("СчетаДоверительногоУправления", Запрос.МенеджерВременныхТаблиц.Таблицы["_СчетаДоверительногоУправления"].ПолучитьДанные().Выгрузить());
	ДанныеДляСверки.Вставить("ДвиженияПоРасчетнымСчетам", Запрос.МенеджерВременныхТаблиц.Таблицы["_ДвиженияПоРасчетнымСчетам"].ПолучитьДанные().Выгрузить());	
	ДанныеДляСверки.Вставить("ОтчетыБрокера", Запрос.МенеджерВременныхТаблиц.Таблицы["_ОтчетыБрокера"].ПолучитьДанные().Выгрузить());
	ДанныеДляСверки.Вставить("СЧА_РСА", Запрос.МенеджерВременныхТаблиц.Таблицы["_СЧА_РСА"].ПолучитьДанные().Выгрузить());
	ДанныеДляСверки.Вставить("МНО", Запрос.МенеджерВременныхТаблиц.Таблицы["_МНО"].ПолучитьДанные().Выгрузить());
	ДанныеДляСверки.Вставить("МНОЗаСледующийДень", Запрос.МенеджерВременныхТаблиц.Таблицы["_МНОЗаСледующийДень"].ПолучитьДанные().Выгрузить());
	
	ДанныеДляСверки.СчетаДоверительногоУправления.Сортировать("Наименование");
	ДанныеДляСверки.ДвиженияПоРасчетнымСчетам.Сортировать("ИнвестСчет, Дата");
	
	Возврат ДанныеДляСверки;
	
КонецФункции

Функция ПроверкаИнвестСчета(СтрокаСчетаДоверительногоУправления, ДокументРезультат)
	
	Успешно = Истина;
	
	Если СтрокаСчетаДоверительногоУправления.НеВыбранСпецДепозитарий Тогда
		ВывестиПоказатель("Депозитарий:", "Отсутствует", ДокументРезультат);
		Успешно = Ложь;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(СтрокаСчетаДоверительногоУправления.ИнвестСчет)  Тогда
		ВывестиПоказатель("Инвест.счет:", "Отсутствует", ДокументРезультат);
		Успешно = Ложь;
	Иначе 
		ВывестиПоказатель("Инвест.счет:", СтрокаСчетаДоверительногоУправления.ИнвестСчет, ДокументРезультат,,Новый Цвет(0, 150, 0));
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

Процедура СверкаДвиженияПоРасчетнымСчетам(СтрокаСчетаДоверительногоУправления, ДвиженияПоРасчетнымСчетам, ДокументыЭДО, ДокументРезультат)
	
	НайденныеСтроки = ДвиженияПоРасчетнымСчетам.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаСчетаДоверительногоУправления.СчетДоверительногоУправления));
	
	Показатель = "";
	Для Каждого СтрокаДвиженияПоРасчетнымСчетам Из НайденныеСтроки Цикл
		Если Показатель <> СтрокаДвиженияПоРасчетнымСчетам.Банк + " " + СтрокаДвиженияПоРасчетнымСчетам.НомерСчета Тогда
			Показатель = СтрокаДвиженияПоРасчетнымСчетам.Банк + " " + СтрокаДвиженияПоРасчетнымСчетам.НомерСчета;
			ВывестиПоказатель(Показатель,, ДокументРезультат, "Банк");
			ПроверитьВЭДО("520", СтрокаДвиженияПоРасчетнымСчетам.Дата,  "Выписка по счету (520)", , СтрокаДвиженияПоРасчетнымСчетам.НомерСчета,, СтрокаДвиженияПоРасчетнымСчетам, ДокументРезультат, ДокументыЭДО);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СверкаОтчетаБрокера(СтрокаСчетаДоверительногоУправления, ОтчетыБрокера, ДокументыЭДО, ДокументРезультат)
	
	НайденныеСтроки = ОтчетыБрокера.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаСчетаДоверительногоУправления.СчетДоверительногоУправления));
	Для Каждого ОтчетБрокера Из НайденныеСтроки Цикл
		ПроверитьВЭДО("522", ОтчетБрокера.Дата, "Отчет Брокера " + ОтчетБрокера.Брокер + ", " + ОтчетБрокера.КодСчетаУБрокера + ", " + ОтчетБрокера.Валюта + " (522)",, "Отчёт брокера",, ОтчетБрокера, ДокументРезультат, ДокументыЭДО,,,Истина, ОтчетБрокера.КодВалюты);
	КонецЦикла;
	
КонецПроцедуры

Процедура СверкаСЧА_РСА(СтрокаСчетаДоверительногоУправления, СЧА_РСА, ДокументыЭДО, ДокументРезультат)
	
	НайденныеСтроки = СЧА_РСА.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаСчетаДоверительногоУправления.СчетДоверительногоУправления));
	Для Каждого СтрокаСЧА_РСА Из НайденныеСтроки Цикл
		ПроверитьВЭДО("029", СтрокаСЧА_РСА.Дата,  "СЧА (029)",,,, СтрокаСЧА_РСА, ДокументРезультат, ДокументыЭДО,,,Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаМНО(СтрокаСчетаДоверительногоУправления, МНО, ДокументыЭДО, ДокументРезультат)
	
	НайденныеСтроки = МНО.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаСчетаДоверительногоУправления.СчетДоверительногоУправления));
	Для Каждого СтрокаМНО Из НайденныеСтроки Цикл
		ВывестиПоказатель("МНО №" + СтрокаМНО.Номер,, ДокументРезультат);
		
		Если СтрокаМНО.КонтрольМНО Тогда
			ПроверитьВЭДО("530", СтрокаМНО.Дата, Строка(СтрокаМНО.Сумма) + " (530)", СтрокаМНО.Сумма,,, СтрокаМНО, ДокументРезультат, ДокументыЭДО,,,Истина);
		КонецЕсли;
		
		Если ПустаяСтрока(СтрокаМНО.НомерПодтверждения) Тогда
			ВывестиПоказатель("Номер подтверждения в МНО" + СтрокаМНО.Номер, "Отсутствует", ДокументРезультат);
		Иначе
			ПроверитьВЭДО("NTD", ДобавитьКДатеРабочиеДниКеш(СтрокаМНО.Дата, 1), "Подтверждение (NTD)",, СтрокаМНО.СтрокаПоиска1, "№" + Строка(СтрокаМНО.НомерПодтверждения), СтрокаМНО, ДокументРезультат, ДокументыЭДО);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаМНОЗаСледующийДень(СтрокаСчетаДоверительногоУправления, МНОЗаСледующийДень, ДокументыЭДО, ДокументРезультат)
	
	НайденныеСтроки = МНОЗаСледующийДень.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаСчетаДоверительногоУправления.СчетДоверительногоУправления));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ВывестиПоказатель("",, ДокументРезультат);
		ВывестиПоказатель(Формат(ДобавитьКДатеРабочиеДниКеш(ЭтотОбъект.Период, 1), "ДФ=dd.MM.yy"),, ДокументРезультат,,Новый Цвет(0, 0, 100));
	КонецЕсли;
	
	Для Каждого СтрокаМНО Из НайденныеСтроки Цикл
		ВывестиПоказатель("МНО №" + СтрокаМНО.Номер,, ДокументРезультат);
		ПроверитьВЭДО("530", СтрокаМНО.Дата, Строка(СтрокаМНО.Сумма) + " (530)", СтрокаМНО.Сумма,,, СтрокаМНО, ДокументРезультат, ДокументыЭДО,,,Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиПоказатель(НазвПоказателя, Статус = "", ДокументРезультат, ИмяОбласти = "Показатель", Цвет = Неопределено)
	
	Если ИмяОбласти = "Показатель" И НЕ ЗначениеЗаполнено(Статус) Тогда
		ИмяОбласти = "ПоказательБезСтатуса";
	КонецЕсли;
	
	Область = ПолучитьМакет("Макет").ПолучитьОбласть(ИмяОбласти);
	
	ЗаполнитьЗначенияСвойств(Область.Параметры, Новый Структура("НазвПоказателя, Статус", НазвПоказателя, Статус));
	
	Если Статус = "Отсутствует" Тогда
		Область.Области[ИмяОбласти].ЦветТекста = Новый Цвет(255, 0, 0);
	ИначеЕсли Статус = "Ок" Тогда
		Область.Области[ИмяОбласти].ЦветТекста = Новый Цвет(0, 150, 0);
	ИначеЕсли Цвет <> Неопределено Тогда
		Область.Области[ИмяОбласти].ЦветТекста = Цвет;
	КонецЕсли;
	
	ДокументРезультат.Вывести(Область);
	
КонецПроцедуры	

Процедура ПроверитьВЭДО(КодДокумента, Дата,  НазвПоказателя, Сумма = 0, СтрокаПоиска1 = "", СтрокаПоиска2 = "", ПараметрыПроверки, ДокументРезультат, ДокументыЭДО, Количество = 1, УдалятьСтроки = Истина, УдалятьВсеСтроки = Ложь, КодВалюты = Неопределено)
	
	Если Количество = 0 Тогда Возврат; КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("КодДепозитария, ИнвестСчет");
	ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ПараметрыПроверки);
	ПараметрыОтбора.Вставить("Дата"			, Дата); 
	ПараметрыОтбора.Вставить("КодДокумента"	, КодДокумента); 
	ПараметрыОтбора.Вставить("Сумма"		, Сумма); 
	
	Если КодВалюты <> Неопределено Тогда
		ПараметрыОтбора.Вставить("Валюта", КодВалюты); 
	КонецЕсли;
	
	НайденныеСтроки = ДокументыЭДО.НайтиСтроки(ПараметрыОтбора);
	УдаляемыеСтроки = Новый Массив;
	
	Для Каждого ДокументЭДО Из НайденныеСтроки Цикл
		Если (ПустаяСтрока(СтрокаПоиска2) ИЛИ Найти(НРег(ДокументЭДО.Инфо), НРег(СтрокаПоиска1)) > 0)
			И (ПустаяСтрока(СтрокаПоиска2) ИЛИ Найти(НРег(ДокументЭДО.Инфо), НРег(СтрокаПоиска2)) > 0) Тогда
			УдаляемыеСтроки.Добавить(ДокументЭДО);
			Количество = Количество - 1;
			
			Если Количество = 0 И НЕ УдалятьВсеСтроки Тогда
				Прервать;
			КонецЕсли;
	    КонецЕсли;
	КонецЦикла;
	
	Если УдалятьСтроки ИЛИ УдалятьВсеСтроки Тогда 
		Для Каждого ДокументЭДО Из УдаляемыеСтроки Цикл 
			ДокументыЭДО.Удалить(ДокументЭДО);
		КонецЦикла;	
	КонецЕсли;
	
	Статус = ?(Количество < 1, "Ок", "Отсутствует");
	
	Если ЗначениеЗаполнено(Сумма) Тогда
		ВывестиПоказатель(НазвПоказателя, Статус, ДокументРезультат, "Сумма");
	Иначе
		ВывестиПоказатель(НазвПоказателя, Статус, ДокументРезультат);
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьКДатеРабочиеДниКеш(ВходящаяДата, КоличествоДней)
	
	Если ТипЗнч(ТаблицаРабочихДат) <> Тип("ТаблицаЗначений") Тогда
		ТаблицаРабочихДат = Новый ТаблицаЗначений;
		ТаблицаРабочихДат.Колонки.Добавить("ВходящаяДата");
		ТаблицаРабочихДат.Колонки.Добавить("КоличествоДней");
		ТаблицаРабочихДат.Колонки.Добавить("ИсходящаяДата");
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура("ВходящаяДата, КоличествоДней", ВходящаяДата, КоличествоДней);
	НайденныеСтроки = ТаблицаРабочихДат.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = ТаблицаРабочихДат.Добавить();
		НоваяСтрока.ВходящаяДата	= ВходящаяДата;
		НоваяСтрока.КоличествоДней	= КоличествоДней;
		НоваяСтрока.ИсходящаяДата	= ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ВходящаяДата, КоличествоДней);
		Возврат НоваяСтрока.ИсходящаяДата;
	Иначе
		Возврат НайденныеСтроки[0].ИсходящаяДата;
	КонецЕсли;
	
КонецФункции

Функция ДобавитьКДатеРабочиеДни(Календарь, Дата, РабочиеДни) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	ДанныеКалендаря.Дата КАК РабочаяДата
		|ПОМЕСТИТЬ РабочиеДни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = &Календарь
		|	И ДанныеКалендаря.Дата < &Дата
		|	И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
		|			ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочаяДата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(РабочиеДни.РабочаяДата) КАК РабочаяДата
		|ИЗ
		|	РабочиеДни КАК РабочиеДни";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "10", Строка(РабочиеДни * ?(РабочиеДни>0,1,-1)));
	Если РабочиеДни>0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДанныеКалендаря.Дата < &Дата", "ДанныеКалендаря.Дата > &Дата");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УБЫВ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МИНИМУМ", "МАКСИМУМ");
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата"		, НачалоДня(Дата));
	Запрос.УстановитьПараметр("Календарь"	, Календарь);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.РабочаяДата;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

МассивСпецДеповДляАвтоформирования = Новый Массив;
